modules/jabber/jabber.org
#+TITLE: Jabber
#+OPTIONS: toc:nil num:nil ^:nil
#+AUTHOR:    Caker
#+EMAIL:     eggcaker@gmail.com
#+DATE:      2011-02-12 Sat
#+DESCRIPTION: configurations of Jabber
#+KEYWORDS: Jabber
#+LANGUAGE:  en
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_HOME: http://webcaker/pelm/modules/jabber.html



* Autoload the Jabber 
#+BEGIN_SRC emacs-lisp
  (load "jabber-autoloads")
#+END_SRC  

* Custome variables

#+BEGIN_SRC emacs-lisp

(custom-set-variables
 '(jabber-alert-message-hooks (quote (jabber-message-awesome jabber-message-echo jabber-message-scroll)))
 '(jabber-alert-presence-hooks (quote (jabber-presence-awesome jabber-presence-echo)))
 '(jabber-avatar-verbose nil)
 '(jabber-backlog-days 3.0)
 '(jabber-history-enabled t)
 '(jabber-roster-show-bindings nil)
 '(jabber-roster-show-title nil)
 '(jabber-show-offline-contacts nil)
 '(jabber-show-resources nil)
 '(jabber-use-global-history nil)
 '(jabber-vcard-avatars-publish nil)
 '(jabber-vcard-avatars-retrieve nil)
 '(joc-eshell-prompt-newline t)
 '(scroll-bar-width nil t)
)
#+END_SRC

#+results:

